
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/naokichin/aws-ecs-terraform/actions/runs/5162967700)



<pre><code>Apply complete! Resources: 4 added, 0 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
Acquiring state lock. This may take a few moments...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0f9c07a8c815600ad]
aws_security_group.alb: Refreshing state... [id=sg-039646b7f9fcf52ca]
aws_security_group.ecs: Refreshing state... [id=sg-01cd8352bdecb0981]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-0484c65d56c312aef]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-0394d7d021b9cee67]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-0edb7c4647f2a2bc7]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-06964098bf82f17d8]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-0dbcdd1e5e2be2539]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-01b1e81a483b996ae]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-00c2c9d62fba11d31]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-09af8f91776c38a83]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0f93c273ac6260b2f]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-07b9b3e7c1bec06dd]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-05f6d219b74a73e42]
aws_security_group_rule.ecs_from_alb: Refreshing state... [id=sgrule-3270240793]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-00c2c9d62fba11d311080289494]
module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-0cc115bd28689188f]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0d646a0f32af9545a]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0e21b23fd2ec88248]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0afaade15c0cd691f]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-057dfecc352214f4e]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0907aad5a5e87d8ca]
module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-0c3f25bb5ebb606c3]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0b8c300fdada68bb3]
module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-0dbcdd1e5e2be25391080289494]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-05f6d219b74a73e421080289494]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_lb.alb will be created
  + resource "aws_lb" "alb" {
      + arn                                         = (known after apply)
      + arn_suffix                                  = (known after apply)
      + desync_mitigation_mode                      = "defensive"
      + dns_name                                    = (known after apply)
      + drop_invalid_header_fields                  = false
      + enable_deletion_protection                  = false
      + enable_http2                                = true
      + enable_tls_version_and_cipher_suite_headers = false
      + enable_waf_fail_open                        = false
      + enable_xff_client_port                      = false
      + id                                          = (known after apply)
      + idle_timeout                                = 60
      + internal                                    = (known after apply)
      + ip_address_type                             = (known after apply)
      + load_balancer_type                          = "application"
      + name                                        = "go-simple-server-alb"
      + preserve_host_header                        = false
      + security_groups                             = [
          + "sg-039646b7f9fcf52ca",
        ]
      + subnets                                     = [
          + "subnet-01b1e81a483b996ae",
          + "subnet-09af8f91776c38a83",
        ]
      + tags_all                                    = (known after apply)
      + vpc_id                                      = (known after apply)
      + xff_header_processing_mode                  = "append"
      + zone_id                                     = (known after apply)
    }

  # aws_lb_listener.alb_listener will be created
  + resource "aws_lb_listener" "alb_listener" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags_all          = (known after apply)

      + default_action {
          + order = (known after apply)
          + type  = "fixed-response"

          + fixed_response {
              + content_type = "text/plain"
              + message_body = "Fixed response content"
              + status_code  = "200"
            }
        }
    }

  # aws_lb_listener_rule.alb_listener_rule will be created
  + resource "aws_lb_listener_rule" "alb_listener_rule" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = (known after apply)
      + priority     = (known after apply)
      + tags_all     = (known after apply)

      + action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }

      + condition {
          + path_pattern {
              + values = [
                  + "*",
                ]
            }
        }
    }

  # aws_lb_target_group.target_group will be created
  + resource "aws_lb_target_group" "target_group" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = false
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "go-simple-server-target-group"
      + port                               = 8080
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags_all                           = (known after apply)
      + target_type                        = "ip"
      + vpc_id                             = "vpc-0f9c07a8c815600ad"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 3
          + interval            = 30
          + matcher             = (known after apply)
          + path                = "/health_checks"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 5
          + unhealthy_threshold = 3
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.
aws_lb.alb: Creating...
aws_lb_target_group.target_group: Creating...
aws_lb_target_group.target_group: Creation complete after 2s [id=arn:aws:elasticloadbalancing:ap-northeast-1:276039551011:targetgroup/go-simple-server-target-group/a4850853c188d1e0]
aws_lb.alb: Still creating... [10s elapsed]
aws_lb.alb: Still creating... [20s elapsed]
aws_lb.alb: Still creating... [30s elapsed]
aws_lb.alb: Still creating... [40s elapsed]
aws_lb.alb: Still creating... [50s elapsed]
aws_lb.alb: Still creating... [1m0s elapsed]
aws_lb.alb: Still creating... [1m10s elapsed]
aws_lb.alb: Still creating... [1m20s elapsed]
aws_lb.alb: Still creating... [1m30s elapsed]
aws_lb.alb: Still creating... [1m40s elapsed]
aws_lb.alb: Still creating... [1m50s elapsed]
aws_lb.alb: Still creating... [2m0s elapsed]
aws_lb.alb: Creation complete after 2m4s [id=arn:aws:elasticloadbalancing:ap-northeast-1:276039551011:loadbalancer/app/go-simple-server-alb/a9c96b90952049ce]
aws_lb_listener.alb_listener: Creating...
aws_lb_listener.alb_listener: Creation complete after 1s [id=arn:aws:elasticloadbalancing:ap-northeast-1:276039551011:listener/app/go-simple-server-alb/a9c96b90952049ce/9d32082826c82131]
aws_lb_listener_rule.alb_listener_rule: Creating...
aws_lb_listener_rule.alb_listener_rule: Creation complete after 0s [id=arn:aws:elasticloadbalancing:ap-northeast-1:276039551011:listener-rule/app/go-simple-server-alb/a9c96b90952049ce/9d32082826c82131/f43eb3311e393bfd]
Releasing state lock. This may take a few moments...

Apply complete! Resources: 4 added, 0 changed, 0 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":4,"Program":"tfcmt","SHA1":"ca25a5ffe860037d7dcb4431fc7e76dc0ca47775","Vars":{},"WorkflowName":"Terraform"} -->